/** ЗАДАЧА 10 - Комментарий перед функцией
 *
 * 1. Объявите функцию с двумя параметрами, значения которых - числа
 *
 * 2. Эта функция должна возвращать разницу между первым и вторым параметром
 *
 * 3. Добавьте многострочный комментарий перед функцией:
 *  - Текст комментария "Возвращает разницу двух чисел"
 *  - Укажите тип параметров - number
 *  - Укажите тип возвращаемого значения - number
 *  - Опишите возвращаемое значение - "Разница чисел"
 *
 * 4. Вызовите функцию
 */


/**
 * Возвращает разницу двух чисел
 * @param {number} number1 - первое число
 * @param {number} number2 - второе число
 * @returns {number} Разница чисел
*/

function Example(number1, number2) {
    return number1 - number2
}

console.log(Example(10, 5))
